# CLI tools
brew "bat"
brew "carapace"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "htop"
brew "just"
brew "lazygit"
brew "neovim"
brew "node"
brew "pam-reattach"
brew "ripgrep"
brew "sesh"
brew "tmux"
brew "uv"
brew "watch"
brew "wget"
brew "yazi"
brew "zoxide"

# Yazi preview prerequisites
brew "ffmpeg"
brew "imagemagick"
brew "poppler"
brew "resvg"
brew "sevenzip"

# Casks
cask "ghostty"
cask "hammerspoon"

# Fonts
cask "font-hack-nerd-font"
